app/Controllers/auth.php

SELECT *
FROM `roles`
---
    public function register()
    {
        helper('form');  // Load form helper for set_value() function

        $roleModel = new \App\Models\RoleModel();
        $roles = $roleModel->findAll();